# DivisionSketchCurveExtentdToSilhParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DivisionSketchCurveExtentdToSilhParam Property
ParameterTypeId Class See Also
---
"Extend to Silhouette"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionSketchCurveExtentdToSilhParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DivisionSketchCurveExtentdToSilhParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace